# Напишете програма, която чете от конзолата две шестцифрени цели числа.
# Винаги първото въведено число ще бъде по-малко от второто.
# На конзолата да се отпечатат на 1, ред разделени с интервал, всички числа, които се намират между двете,
# прочетени от конзолата числа и отговарят на условието сумата от цифрите на четни и нечетни позиции да са равни.
# Ако няма числа, отговарящи на условието на конзолата не се извежда резултат.

n1 = int(input())
n2 = int(input())

for number in range(n1, n2 + 1):
    number_to_str = str(number)
    odd_sum = 0
    even_sum = 0
    for index, digit in enumerate(number_to_str):
        if index % 2 == 0:
            even_sum += int(digit)
        else:
            odd_sum += int(digit)
    if even_sum == odd_sum:
        print(number, end=' ')