# Курсът "Train the trainers" е към края си и финалното оценяване наближава. Вашата задача е да помогнете на журито,
# което ще оценява презентациите, като напишете програма, в която да изчислява средната оценка от представянето на
# всяка една презентация от даден студент, а накрая - средния успех от всички тях.
# От конзолата на първият ред се прочита броят на хората в журито n - цяло число.
# След това на отделен ред се прочита името на презентацията – текст.
# За всяка една презентация на нов ред се четат n - на брой оценки - реално число.
# След изчисляване на средната оценка за конкретна презентация, на конзолата се печата:
# "{името на презентацията} - {средна оценка}."
# След получаване на команда "Finish", на конзолата се печата
# "Student's final assessment is {среден успех от всички презентации}." и програмата приключва.
# Всички оценки трябва да бъдат форматирани до втория знак след десетичната запетая.

jury = int(input())
presentation_name = input()

sum_of = 0
grade_count = 0
average = 0

while presentation_name != "Finish":
    current_presentation = presentation_name
    for i in range(jury):
        grade = float(input())
        sum_of += grade
        grade_count += 1
    average += sum_of
    print(f"{current_presentation} - {(sum_of / jury) :.2f}.")
    sum_of = 0
    presentation_name = input()

print(f"Student's final assessment is {(average / grade_count) :.2f}.")
