# # Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент p1 са под 200, друг процент p2 са от 200 до 399,
# # друг процент p3 са от 400 до 599, друг процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре.
# # Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
# # Пример: имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 800, 799, 199, 46, 128, 65.
# # Получаваме следното разпределение и визуализация:

num = int(input())

count_1, count_2, count_3, count_4, count_5 = 0, 0, 0, 0, 0
p1_percent, p2_percent, p3_percent, p4_percent, p5_percent = 0, 0, 0, 0, 0

for _ in range(num):
    new_input = int(input())
    if 1 <= new_input < 200:
        count_1 += 1
        p1_percent = count_1 / num * 100
    elif 200 <= new_input < 400:
        count_2 += 1
        p2_percent = count_2 / num * 100
    elif 400 <= new_input < 600:
        count_3 += 1
        p3_percent = count_3 / num * 100
    elif 600 <= new_input < 800:
        count_4 += 1
        p4_percent = count_4 / num * 100
    else:
        count_5 += 1
        p5_percent = count_5 / num * 100

print(f"{p1_percent :.2f}%")
print(f"{p2_percent :.2f}%")
print(f"{p3_percent :.2f}%")
print(f"{p4_percent :.2f}%")
print(f"{p5_percent :.2f}%")


# Вход
# На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа. На следващите n реда стои по едно цяло число
# в интервала [1…1000] – числата върху които да бъде изчислена хистограмата.

# Изход
# Да се отпечата на конзолата хистограмата – 5 реда, всеки от които съдържа число между 0% и 100%, с точност две цифри
# след десетичната точка, например 25.00%, 66.67%, 57.14%.